-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-
> analysis/7-tfgh-kendall-tau.log
  log type:  text
 opened on:  21 Feb 2019, 12:48:42

. **************************************
. * WASH Benefits Bangladesh STH KK qPCR validation
. * calculate correlation between epg and CT value
. * using Kendall's tau beta
. **************************************
. 
. insheet using "~/Dropbox/WASH-B-STH-Add-on/TFGH/Data/RData/qdata.csv", clear
(61 vars, 2,800 obs)

. 
. foreach var of varlist ctmeanac ctmeanad ctmeanal2 ctmeanna ctmeantt{
  2.         replace `var' = "" if `var'=="NA"
  3.         destring `var', replace
  4. }
(2,694 real changes made)
ctmeanac: all characters numeric; replaced as double
(2694 missing values generated)
(2,799 real changes made)
ctmeanad: all characters numeric; replaced as double
(2799 missing values generated)
(2,157 real changes made)
ctmeanal2: all characters numeric; replaced as double
(2157 missing values generated)
(2,285 real changes made)
ctmeanna: all characters numeric; replaced as double
(2285 missing values generated)
(2,457 real changes made)
ctmeantt: all characters numeric; replaced as double
(2457 missing values generated)

. 
. 
. 
. ktau alepg ctmeanal2, stats(taub)

  Number of obs =     643
Kendall's tau-a =      -0.3745
Kendall's tau-b =      -0.4386
Kendall's score =  -77290
    SE of score =    5054.509   (corrected for ties)

Test of Ho: alepg and ctmeanal2 are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg ctmeanna, stats(taub)

  Number of obs =     515
Kendall's tau-a =      -0.2598
Kendall's tau-b =      -0.3458
Kendall's score =  -34384
    SE of score =    3302.852   (corrected for ties)

Test of Ho: hwepg and ctmeanna are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg ctmeanac, stats(taub)

  Number of obs =     106
Kendall's tau-a =      -0.1799
Kendall's tau-b =      -0.2661
Kendall's score =   -1001
    SE of score =     283.604   (corrected for ties)

Test of Ho: hwepg and ctmeanac are independent
     Prob > |z| =       0.0004  (continuity corrected)

. ktau ttepg ctmeantt, stats(taub)

  Number of obs =     343
Kendall's tau-a =      -0.2113
Kendall's tau-b =      -0.2478
Kendall's score =  -12391
    SE of score =    1972.262   (corrected for ties)

Test of Ho: ttepg and ctmeantt are independent
     Prob > |z| =       0.0000  (continuity corrected)

. 
. 
. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau alepg ctmeanal2, stats(t
> aub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample),
          bootstrap has no way to determine which observations are used in calculating
          the statistics and so assumes that all observations are used.  This means
          that no observations will be excluded from the resampling because of missing
          values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory
          contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau alepg ctmeanal2, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.4386392    .033638   -13.04   0.000    -.5045684   -.3727099
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg ctmeanna, stats(ta
> ub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample),
          bootstrap has no way to determine which observations are used in calculating
          the statistics and so assumes that all observations are used.  This means
          that no observations will be excluded from the resampling because of missing
          values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory
          contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg ctmeanna, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.3457696   .0285826   -12.10   0.000    -.4017905   -.2897488
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg ctmeanac, stats(ta
> ub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample),
          bootstrap has no way to determine which observations are used in calculating
          the statistics and so assumes that all observations are used.  This means
          that no observations will be excluded from the resampling because of missing
          values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory
          contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg ctmeanac, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.2660899   .0666105    -3.99   0.000    -.3966441   -.1355356
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau ttepg ctmeantt, stats(ta
> ub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample),
          bootstrap has no way to determine which observations are used in calculating
          the statistics and so assumes that all observations are used.  This means
          that no observations will be excluded from the resampling because of missing
          values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory
          contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau ttepg ctmeantt, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.2478042   .0430547    -5.76   0.000    -.3321898   -.1634186
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-
> analysis/7-tfgh-kendall-tau.log
  log type:  text
 closed on:  21 Feb 2019, 12:50:23
-----------------------------------------------------------------------------------------
