-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/5-tfgh-kendall-tau.log
  log type:  text
 opened on:   3 Apr 2019, 13:58:06

. **************************************
. * WASH Benefits Bangladesh STH KK qPCR validation
. * calculate correlation between epg and CT value
. * using Kendall's tau beta
. **************************************
. 
. insheet using "~/Dropbox/WASH-B-STH-Add-on/TFGH/Data/RData/qdata.csv", clear
(61 vars, 2,800 obs)

. 
. foreach var of varlist ctmeanac ctmeanad ctmeanal2 ctmeanna ctmeantt positivena positiveac positivead{
  2.         replace `var' = "" if `var'=="NA"
  3.         destring `var', replace
  4. }
(2,694 real changes made)
ctmeanac: all characters numeric; replaced as double
(2694 missing values generated)
(2,799 real changes made)
ctmeanad: all characters numeric; replaced as double
(2799 missing values generated)
(2,148 real changes made)
ctmeanal2: all characters numeric; replaced as double
(2148 missing values generated)
(2,285 real changes made)
ctmeanna: all characters numeric; replaced as double
(2285 missing values generated)
(2,457 real changes made)
ctmeantt: all characters numeric; replaced as double
(2457 missing values generated)
(1 real change made)
positivena: all characters numeric; replaced as byte
(1 missing value generated)
(1 real change made)
positiveac: all characters numeric; replaced as byte
(1 missing value generated)
(1 real change made)
positivead: all characters numeric; replaced as byte
(1 missing value generated)

. 
. gen ctmeanhw = .
(2,800 missing values generated)

. replace ctmeanhw = ctmeanna if positivena==1 & positiveac==0 & positivead==0
(491 real changes made)

. replace ctmeanhw = ctmeanac if positivena==0 & positiveac==1 & positivead==0
(83 real changes made)

. replace ctmeanhw = ctmeanad if positivena==0 & positiveac==0 & positivead==1
(0 real changes made)

. replace ctmeanhw = (ctmeanna + ctmeanac)/2 if positivena==1 & positiveac==1 & positivead==0
(23 real changes made)

. replace ctmeanhw = (ctmeanna + ctmeanad)/2 if positivena==1 & positiveac==0 & positivead==1
(1 real change made)

. replace ctmeanhw = (ctmeanna + ctmeanac)/2 if positivena==1 & positiveac==1 & positivead==0
(0 real changes made)

. replace ctmeanhw = (ctmeanac + ctmeanad)/2 if positivena==0 & positiveac==1 & positivead==1
(0 real changes made)

. 
. 
. ktau alepg ctmeanal2, stats(taub)

  Number of obs =     652
Kendall's tau-a =      -0.3788
Kendall's tau-b =      -0.4424
Kendall's score =  -80381
    SE of score =    5170.499   (corrected for ties)

Test of Ho: alepg and ctmeanal2 are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg ctmeanna, stats(taub)

  Number of obs =     515
Kendall's tau-a =      -0.2598
Kendall's tau-b =      -0.3458
Kendall's score =  -34384
    SE of score =    3302.852   (corrected for ties)

Test of Ho: hwepg and ctmeanna are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg ctmeanac, stats(taub)

  Number of obs =     106
Kendall's tau-a =      -0.1799
Kendall's tau-b =      -0.2661
Kendall's score =   -1001
    SE of score =     283.604   (corrected for ties)

Test of Ho: hwepg and ctmeanac are independent
     Prob > |z| =       0.0004  (continuity corrected)

. ktau hwepg ctmeanhw, stats(taub)

  Number of obs =     598
Kendall's tau-a =      -0.2484
Kendall's tau-b =      -0.3377
Kendall's score =  -44344
    SE of score =    4064.149   (corrected for ties)

Test of Ho: hwepg and ctmeanhw are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau ttepg ctmeantt, stats(taub)

  Number of obs =     343
Kendall's tau-a =      -0.2113
Kendall's tau-b =      -0.2478
Kendall's score =  -12391
    SE of score =    1972.262   (corrected for ties)

Test of Ho: ttepg and ctmeantt are independent
     Prob > |z| =       0.0000  (continuity corrected)

. 
. 
. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau alepg ctmeanal2, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to determine which
          observations are used in calculating the statistics and so assumes that all observations are used.  This
          means that no observations will be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded.
          Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau alepg ctmeanal2, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   -.442372   .0325265   -13.60   0.000    -.5061228   -.3786212
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg ctmeanna, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to determine which
          observations are used in calculating the statistics and so assumes that all observations are used.  This
          means that no observations will be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded.
          Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg ctmeanna, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.3457696   .0285826   -12.10   0.000    -.4017905   -.2897488
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg ctmeanac, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to determine which
          observations are used in calculating the statistics and so assumes that all observations are used.  This
          means that no observations will be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded.
          Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg ctmeanac, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.2660899   .0666105    -3.99   0.000    -.3966441   -.1355356
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau ttepg ctmeantt, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to determine which
          observations are used in calculating the statistics and so assumes that all observations are used.  This
          means that no observations will be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded.
          Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau ttepg ctmeantt, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.2478042   .0430547    -5.76   0.000    -.3321898   -.1634186
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/5-tfgh-kendall-tau.log
  log type:  text
 closed on:   3 Apr 2019, 13:59:31
-------------------------------------------------------------------------------------------------------------------------
