--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/tfgh-k
> endall-tau.log
  log type:  text
 opened on:  17 Jul 2018, 17:06:37

. **************************************
. * WASH Benefits Bangladesh STH KK qPCR validation
. * calculate correlation between epg and DNA copies
. * using Kendall's tau beta
. **************************************
. 
. insheet using "~/Dropbox/WASH-B-STH-Add-on/TFGH/Data/RData/concentration.csv", clear
(57 vars, 2,800 obs)

. 
. foreach var of varlist copiesal copiesna copiesad copiesac copiestt{
  2.         replace `var' = "0" if `var'=="NA"
  3.         destring `var', replace
  4. }
(2,445 real changes made)
copiesal: all characters numeric; replaced as double
(2,285 real changes made)
copiesna: all characters numeric; replaced as double
(2,799 real changes made)
copiesad: all characters numeric; replaced as double
(2,694 real changes made)
copiesac: all characters numeric; replaced as double
(2,457 real changes made)
copiestt: all characters numeric; replaced as double

. 
. 
. ktau alepg copiesal, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.1122
Kendall's tau-b =       0.2997
Kendall's score =  439541
    SE of score =   24711.260   (corrected for ties)

Test of Ho: alepg and copiesal are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg copiesna, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.1080
Kendall's tau-b =       0.4935
Kendall's score =  423396
    SE of score =   15207.794   (corrected for ties)

Test of Ho: hwepg and copiesna are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg copiesac, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.0145
Kendall's tau-b =       0.1406
Kendall's score =   56884
    SE of score =    7442.153   (corrected for ties)

Test of Ho: hwepg and copiesac are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau ttepg copiestt, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.1059
Kendall's tau-b =       0.6024
Kendall's score =  414816
    SE of score =   12413.068   (corrected for ties)

Test of Ho: ttepg and copiestt are independent
     Prob > |z| =       0.0000  (continuity corrected)

. 
. 
. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau alepg copiesal, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau alepg copiesal, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .2996786   .0288824    10.38   0.000     .2430701    .3562871
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg copiesna, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg copiesna, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .4935142   .0226426    21.80   0.000     .4491356    .5378928
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg copiesac, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg copiesac, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |    .140602    .032254     4.36   0.000     .0773853    .2038187
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau ttepg copiestt, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau ttepg copiestt, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .6024472   .0227644    26.46   0.000     .5578298    .6470646
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/tfgh-k
> endall-tau.log
  log type:  text
 closed on:  17 Jul 2018, 17:15:19
--------------------------------------------------------------------------------------------------------
