--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/tfgh-k
> endall-tau.log
  log type:  text
 opened on:  10 Jul 2018, 11:30:53

. **************************************
. * WASH Benefits Bangladesh STH KK qPCR validation
. * calculate correlation between epg and DNA copies
. * using Kendall's tau beta
. **************************************
. 
. insheet using "~/Dropbox/WASH-B-STH-Add-on/TFGH/Data/RData/concentration.csv", clear
(57 vars, 2,800 obs)

. 
. replace alepg="." if alepg=="NA"
(11 real changes made)

. replace hwepg="." if hwepg=="NA"
(11 real changes made)

. replace ttepg="." if ttepg=="NA"
(11 real changes made)

. destring alepg hwepg ttepg, replace
alepg: all characters numeric; replaced as long
(11 missing values generated)
hwepg: all characters numeric; replaced as int
(11 missing values generated)
ttepg: all characters numeric; replaced as int
(11 missing values generated)

. 
. foreach var of varlist copiesal copiesna copiesad copiesac copiestt{
  2.         replace `var' = "0" if `var'=="NA"
  3.         destring `var', replace
  4. }
(2,445 real changes made)
copiesal: all characters numeric; replaced as double
(2,285 real changes made)
copiesna: all characters numeric; replaced as double
(2,799 real changes made)
copiesad: all characters numeric; replaced as double
(2,694 real changes made)
copiesac: all characters numeric; replaced as double
(2,457 real changes made)
copiestt: all characters numeric; replaced as double

. 
. 
. ktau alepg copiesal, stats(taub)

  Number of obs =    2789
Kendall's tau-a =       0.1115
Kendall's tau-b =       0.2984
Kendall's score =  433381
    SE of score =   24517.779   (corrected for ties)

Test of Ho: alepg and copiesal are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg copiesna, stats(taub)

  Number of obs =    2789
Kendall's tau-a =       0.1084
Kendall's tau-b =       0.4938
Kendall's score =  421485
    SE of score =   15157.923   (corrected for ties)

Test of Ho: hwepg and copiesna are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg copiesac, stats(taub)

  Number of obs =    2789
Kendall's tau-a =       0.0146
Kendall's tau-b =       0.1404
Kendall's score =   56576
    SE of score =    7425.843   (corrected for ties)

Test of Ho: hwepg and copiesac are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau ttepg copiestt, stats(taub)

  Number of obs =    2789
Kendall's tau-a =       0.1062
Kendall's tau-b =       0.6023
Kendall's score =  412979
    SE of score =   12383.815   (corrected for ties)

Test of Ho: ttepg and copiestt are independent
     Prob > |z| =       0.0000  (continuity corrected)

. 
. 
. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau alepg copiesal, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau alepg copiesal, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 69 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .2984456   .0273186    10.92   0.000     .2449022     .351989
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg copiesna, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg copiesna, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 69 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .4937938   .0216681    22.79   0.000     .4513251    .5362626
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg copiesac, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg copiesac, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 69 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |    .140409   .0313476     4.48   0.000     .0789687    .2018492
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau ttepg copiestt, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau ttepg copiestt, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 69 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .6022678   .0226415    26.60   0.000     .5578913    .6466444
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/tfgh-k
> endall-tau.log
  log type:  text
 closed on:  10 Jul 2018, 11:38:50
--------------------------------------------------------------------------------------------------------
