--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/tfgh-k
> endall-tau.log
  log type:  text
 opened on:  19 Jul 2018, 08:11:42

. **************************************
. * WASH Benefits Bangladesh STH KK qPCR validation
. * calculate correlation between epg and CT value
. * using Kendall's tau beta
. **************************************
. 
. insheet using "~/Dropbox/WASH-B-STH-Add-on/TFGH/Data/RData/qdata.csv", clear
(51 vars, 2,800 obs)

. 
. foreach var of varlist ctmeanac ctmeanad ctmeanal ctmeanna ctmeantt{
  2.         replace `var' = "0" if `var'=="NA"
  3.         destring `var', replace
  4. }
(2,694 real changes made)
ctmeanac: all characters numeric; replaced as double
(2,799 real changes made)
ctmeanad: all characters numeric; replaced as double
(2,445 real changes made)
ctmeanal: all characters numeric; replaced as double
(2,285 real changes made)
ctmeanna: all characters numeric; replaced as double
(2,457 real changes made)
ctmeantt: all characters numeric; replaced as double

. 
. 
. ktau alepg ctmeanal, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.0953
Kendall's tau-b =       0.2547
Kendall's score =  373591
    SE of score =   24711.260   (corrected for ties)

Test of Ho: alepg and ctmeanal are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg ctmeanna, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.0905
Kendall's tau-b =       0.4134
Kendall's score =  354628
    SE of score =   15207.794   (corrected for ties)

Test of Ho: hwepg and ctmeanna are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau hwepg ctmeanac, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.0140
Kendall's tau-b =       0.1357
Kendall's score =   54882
    SE of score =    7442.153   (corrected for ties)

Test of Ho: hwepg and ctmeanac are independent
     Prob > |z| =       0.0000  (continuity corrected)

. ktau ttepg ctmeantt, stats(taub)

  Number of obs =    2800
Kendall's tau-a =       0.0995
Kendall's tau-b =       0.5665
Kendall's score =  390034
    SE of score =   12413.068   (corrected for ties)

Test of Ho: ttepg and ctmeantt are independent
     Prob > |z| =       0.0000  (continuity corrected)

. 
. 
. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau alepg ctmeanal, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau alepg ctmeanal, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |    .254714   .0238703    10.67   0.000      .207929    .3014989
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg ctmeanna, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg ctmeanna, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .4133576   .0182933    22.60   0.000     .3775034    .4492118
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau hwepg ctmeanac, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau hwepg ctmeanac, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .1356536   .0315625     4.30   0.000     .0737922     .197515
------------------------------------------------------------------------------

. bootstrap r(tau_b), reps(1000) seed(1234) cluster(block): ktau ttepg ctmeantt, stats(taub)
(running ktau on estimation sample)

Warning:  Because ktau is not an estimation command or does not set e(sample), bootstrap has no way to
          determine which observations are used in calculating the statistics and so assumes that all
          observations are used.  This means that no observations will be excluded from the resampling
          because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the observations that
          are to be excluded.  Be sure that the dataset in memory contains only the relevant data.

Bootstrap replications (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000

Bootstrap results                               Number of obs     =      2,800
                                                Replications      =      1,000

      command:  ktau ttepg ctmeantt, stats(taub)
        _bs_1:  r(tau_b)

                                  (Replications based on 68 clusters in block)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .5664557   .0194174    29.17   0.000     .5283984    .6045131
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/jadederong/Documents/CRG/wash-benefits/bangladesh/src/wbb-sth-qpcr/1-analysis/tfgh-k
> endall-tau.log
  log type:  text
 closed on:  19 Jul 2018, 08:23:36
--------------------------------------------------------------------------------------------------------
